# Group By Exercises

<hr style="border:2px solid gray">

1. Create a new file named group_by_exercises.sql

2. In your script, use DISTINCT to find the unique titles in the titles table. How many unique titles have there ever been? Answer that in a comment in your SQL file.

3. Write a query to to find a list of all unique last names of all employees that start and end with 'E' using GROUP BY.

4. Write a query to to find all unique combinations of first and last names of all employees whose last names start and end with 'E'.

5. Write a query to find the unique last names with a 'q' but not 'qu'. Include those names in a comment in your sql code.

6. Add a COUNT() to your results (the query above) to find the number of employees with the same last name.

7. Find all all employees with first names 'Irena', 'Vidya', or 'Maya'. Use COUNT(*) and GROUP BY to find the number of employees for each gender with those names.

8. Using your query that generates a username for all of the employees, generate a count employees for each unique username.

9. From your previous query, are there any duplicate usernames? What is the higest number of times a username shows up?

<hr style="border:0.5px solid black">
<hr style="border:0.5px solid black">

<b>1. Create a new file named group_by_exercises.sql

In [ ]:
USE employees;

<hr style="border:1px solid black">

<b>2. In your script, use DISTINCT to find the unique titles in the titles table. How many unique titles have there ever been? Answer that in a comment in your SQL file.

In [ ]:
#Simpy answering the question
select count(DISTINCT title)
    AS unique_titles
FROM titles;

In [ ]:
#If we want to see what those unique titles actually are
SELECT DISTINCT title
FROM titles;

In [ ]:
#Now, what if we want a count of each unique title
SELECT DISTINCT title, COUNT(*)
FROM titles
GROUP BY title
ORDER BY COUNT(*) DESC;

<b>Answer</b>: 7

<hr style="border:1px solid black">

<b>3. Write a query to find a list of all unique last names of all employees that start and end with 'E' using GROUP BY.

In [ ]:
#If I want the names in order
SELECT DISTINCT last_name
FROM employees
WHERE last_name like 'e%e'
GROUP BY last_name;

In [ ]:
#What if I want most frequent last name to least frequent?
SELECT DISTINCT last_name, COUNT(*)
FROM employees
WHERE last_name like 'e%e'
GROUP BY last_name
ORDER BY COUNT(*) DESC;

<b>Answer</b>:
- Erbe 186
- Erde 185
- Erie 180
- Eldridge 174
- Etalle 174

<hr style="border:1px solid black">

<b>4. Write a query to to find all unique combinations of first and last names of all employees whose last names start and end with 'E'.

In [ ]:
#simply answering the question
SELECT first_name, 
    last_name
FROM employees
WHERE last_name LIKE 'e%e'
GROUP BY first_name , last_name;

In [ ]:
#Getting more specific with a count
SELECT first_name, 
    last_name,
    COUNT(*) as 'first_last_name_combos'
FROM employees
WHERE last_name LIKE 'e%e'
GROUP BY first_name , last_name;

In [ ]:
#Now, let's put them in order by most common name pair
SELECT first_name, 
    last_name,
    COUNT(*) as 'first_last_name_combos'
FROM employees
WHERE last_name LIKE 'e%e'
GROUP BY first_name , last_name
ORDER BY first_last_name_combos DESC;

<hr style="border:1px solid black">

<b>5. Write a query to find the unique last names with a 'q' but not 'qu'. Include those names in a comment in your sql code.

In [ ]:
#Simply answering the question
SELECT last_name
FROM employees
WHERE last_name LIKE '%q%'
    AND last_name NOT LIKE '%qu%'
GROUP BY last_name;

<b>Answer</b>:
- Chleq
- Lindqvist
- Qiwen

<hr style="border:1px solid black">

<b>6. Add a COUNT() to your results (the query above) to find the number of employees with the same last name.

In [ ]:
SELECT last_name, 
    COUNT(last_name) AS 'number_of_employees'
FROM employees
WHERE last_name LIKE '%q%'
    AND last_name NOT LIKE '%qu%'
GROUP BY last_name;

In [ ]:
#put them in order
SELECT last_name, 
    COUNT(last_name) AS 'number_of_employees'
FROM employees
WHERE last_name LIKE '%q%'
    AND last_name NOT LIKE '%qu%'
GROUP BY last_name
ORDER BY number_of_employees DESC;

<hr style="border:1px solid black">

<b>7. Find all employees with first names 'Irena', 'Vidya', or 'Maya'. Use COUNT(*) and GROUP BY to find the number of employees for each gender with those names.

In [ ]:
SELECT gender, 
    first_name, 
    COUNT(*) AS 'name_by_gender'
FROM employees
WHERE first_name IN ('Irene' , 'Vidya', 'Maya')
GROUP BY gender, first_name;

In [ ]:
#put them in order by most common
SELECT gender, 
    first_name, 
    COUNT(*) AS 'name_by_gender'
FROM employees
WHERE first_name IN ('Irene' , 'Vidya', 'Maya')
GROUP BY gender, first_name
ORDER BY name_by_gender DESC;

<hr style="border:1px solid black">

<b>8. Using your query that generates a username for all of the employees, generate a count employees for each unique username.

In [ ]:
SELECT 
    LOWER(
        CONCAT(
            SUBSTR(first_name, 1, 1),
            SUBSTR(last_name, 1, 4),
            '_',
            SUBSTR(birth_date, 6, 2),
            SUBSTR(birth_date, 3, 2)
        )
    ) AS username,
    COUNT(*) AS count_of_usernames
FROM employees
GROUP BY username;

In [ ]:
SELECT 
    LOWER(
        CONCAT(
            SUBSTR(first_name, 1, 1),
            SUBSTR(last_name, 1, 4),
            '_',
            SUBSTR(birth_date, 6, 2),
            SUBSTR(birth_date, 3, 2)
        )
    ) AS username,
    COUNT(*) AS count_of_usernames
FROM employees
GROUP BY username;

<hr style="border:1px solid black">

<b>9. From your previous query, are there any duplicate usernames? What is the higest number of times a username shows up?

In [ ]:
SELECT 
    LOWER(
            CONCAT(
                SUBSTR(first_name, 1, 1),
                SUBSTR(last_name, 1, 4),
                '_',
                SUBSTR(birth_date, 6, 2),
                SUBSTR(birth_date, 3, 2)
                )
            ) AS username,
            count(*) AS count_of_usernames
FROM employees
GROUP BY username
HAVING count_of_usernames > 1
ORDER BY count_of_usernames DESC;

<b>Answer</b>: Yes there are duplicates. The highest number of times a username shows up is 6.

<b>9. Bonus: How many duplicate usernames are there from your previous query?

In [ ]:
SELECT COUNT(*) AS num_duplicate_usernames
FROM (
  SELECT 
    LOWER(
      CONCAT(
        SUBSTR(first_name, 1, 1),
        SUBSTR(last_name, 1, 4),
        '_',
        SUBSTR(birth_date, 6, 2),
        SUBSTR(birth_date, 3, 2)
      )
    ) AS username,
    COUNT(*) AS count_of_usernames
  FROM employees
  GROUP BY username
  HAVING count_of_usernames > 1
) AS subquery;

<b>Answer</b>: 13,251